build/docs/runtime/objects/user/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>User Object</title>
<!-- 2017-04-27 Thu 09:31 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD" />
<link rel="stylesheet" type="text/css" href="../../../style/css/worg-style.css" />
<link rel="stylesheet" type="text/css" href="../../../style/css/override.css" />
<link rel="icon" type="image/png" href="../../../style/img/favicon/popl.png" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">User Object</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. User</a></li>
<li><a href="#sec-2">2. Test User</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> User</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>User</code> is a class with fields of type <code>Email</code> and <code>Name</code>.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">from</span> runtime.utils.type_utils.type_utils <span style="font-weight: bold;">import</span> list_of
<span style="font-weight: bold;">from</span> runtime.utils.factories.property_class_factory <span style="font-weight: bold;">import</span> PropertyClassFactory
<span style="font-weight: bold;">from</span> runtime.objects.email.email <span style="font-weight: bold;">import</span> Email
<span style="font-weight: bold;">from</span> runtime.objects.name.name <span style="font-weight: bold;">import</span> Name
<span style="font-weight: bold;">from</span> runtime.objects.role.role <span style="font-weight: bold;">import</span> Role

<span style="font-weight: bold; font-style: italic;">User</span> = PropertyClassFactory.mk_class(<span style="font-style: italic;">"User"</span>, [<span style="font-style: italic;">'email'</span>], 
                                     email=Email.is_inst, 
                                     name=Name.is_inst,
                                     roles=list_of(Role.is_inst))


<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">append_role</span>(<span style="font-weight: bold;">self</span>, role):
    <span style="font-weight: bold;">if</span> Role.is_inst(role):
        <span style="font-weight: bold; font-style: italic;">roles</span> = <span style="font-weight: bold;">self</span>.get(<span style="font-style: italic;">'roles'</span>)
        roles.append(role)
        <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">set</span>(roles=roles)

<span style="font-weight: bold; font-style: italic;">User.append_role</span> = append_role
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Test User</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">import</span> unittest
<span style="font-weight: bold;">from</span> unittest <span style="font-weight: bold;">import</span> TestCase

<span style="font-weight: bold;">from</span> runtime.objects.email.email <span style="font-weight: bold;">import</span> Email
<span style="font-weight: bold;">from</span> runtime.objects.name.name <span style="font-weight: bold;">import</span> Name
<span style="font-weight: bold;">from</span> runtime.objects.role.role <span style="font-weight: bold;">import</span> Role
<span style="font-weight: bold;">from</span> runtime.objects.user.user <span style="font-weight: bold;">import</span> User


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">TestUser</span>(TestCase):
    <span style="font-weight: bold; font-style: italic;">TESTING</span> = <span style="font-weight: bold; text-decoration: underline;">True</span>

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_instantiate_user</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">"test_instantiate_user"</span>
        <span style="font-weight: bold; font-style: italic;">user</span> = User(name=Name(val=<span style="font-style: italic;">"Jimi Hendrix"</span>),
                    email=Email(val=<span style="font-style: italic;">"jimi@gnu.org"</span>),
                    roles=[])

        <span style="font-weight: bold;">self</span>.assertEqual(User.is_inst(user), <span style="font-weight: bold; text-decoration: underline;">True</span>)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_sets_on_user</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">"test_sets_on_user"</span>
        <span style="font-weight: bold; font-style: italic;">user</span> = User(name=Name(val=<span style="font-style: italic;">"Jimi Hendrix"</span>),
                    email=Email(val=<span style="font-style: italic;">"jimi@gnu.org"</span>),
                    roles=[Role(val=<span style="font-style: italic;">"user"</span>)])

        user.<span style="font-weight: bold;">set</span>(email=Email(val=<span style="font-style: italic;">"tmp@abc.com"</span>))

        <span style="font-weight: bold;">self</span>.assertEqual(user.get(<span style="font-style: italic;">"name"</span>).get(<span style="font-style: italic;">"val"</span>), <span style="font-style: italic;">"Jimi Hendrix"</span>)
        <span style="font-weight: bold;">self</span>.assertEqual(user.get(<span style="font-style: italic;">"email"</span>).get(<span style="font-style: italic;">"val"</span>), <span style="font-style: italic;">"tmp@abc.com"</span>)
        <span style="font-weight: bold;">self</span>.assertEqual(user.get(<span style="font-style: italic;">"roles"</span>)[0].get(<span style="font-style: italic;">"val"</span>), <span style="font-style: italic;">"user"</span>)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_equality_on_user</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">"test_equality_on_user"</span>
        <span style="font-weight: bold; font-style: italic;">user1</span> = User(name=Name(val=<span style="font-style: italic;">"Jimi Hendrix"</span>),
                     email=Email(val=<span style="font-style: italic;">"jimi@gnu.org"</span>),
                     roles=[])

        <span style="font-weight: bold; font-style: italic;">user2</span> = User(name=Name(val=<span style="font-style: italic;">"Jimi Hendrix"</span>),
                     email=Email(val=<span style="font-style: italic;">"jimi@gnu.org"</span>),
                     roles=[]) 

        <span style="font-weight: bold; font-style: italic;">user3</span> = User(name=Name(val=<span style="font-style: italic;">"John Roy"</span>),
                     email=Email(val=<span style="font-style: italic;">"roy@gnu.org"</span>),
                     roles=[])

        <span style="font-weight: bold;">self</span>.assertEqual(user1 == user2, <span style="font-weight: bold; text-decoration: underline;">True</span>)
        <span style="font-weight: bold;">self</span>.assertEqual(user1 == user3, <span style="font-weight: bold; text-decoration: underline;">False</span>)
        
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_append_role</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">"test_append_role"</span>
        <span style="font-weight: bold; font-style: italic;">user</span> = User(name=Name(val=<span style="font-style: italic;">"Jimi Hendrix"</span>),
                     email=Email(val=<span style="font-style: italic;">"jimi@gnu.org"</span>),
                     roles=[])

        user.append_role(Role(val=<span style="font-style: italic;">"user"</span>))
        <span style="font-weight: bold;">self</span>.assertTrue(<span style="font-weight: bold;">len</span>(user.get(<span style="font-style: italic;">'roles'</span>)) == 1)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2017-04-25 Tue]</span></span></p>
<p class="author">Author: VLEAD</p>
<p class="date">Created: 2017-04-27 Thu 09:31</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
